IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_nmi_intrupt_regs.xml
<module id="CM_NMI_INTRUPT_REGS" HW_revision="" description="CM NMI INTRUPT Registers">
	<register id="CMNMICFG" width="32" page="1" offset="0x0" internal="0" description="CM NMI Configuration Register">
		<bitfield id="NMIE" description="Global NMI Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key protection" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMNMIFLG" width="32" page="1" offset="0x4" internal="0" description="CM NMI Flag Register">
		<bitfield id="NMIINT" description="NMI Interrupt Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLOCKFAIL" description="Clock Fail Interrupt Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MEMUNCERR" description="RAM, ROM Uncorrectable Error NMI Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FLUNCERR" description="Flash Uncorrectable Error NMI Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MCANUNCERR" description="MCAN Uncorrectable Error NMI Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="WWDNMI" description="CM WWD NMI flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ECATNMI" description="NMI from EtherCAT reset out" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
	<register id="CMNMIFLGCLR" width="32" page="1" offset="0x8" internal="0" description="CMNMI Flag Clear Register">
		<bitfield id="NMIINT" description="NMIINT  Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL  Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MEMUNCERR" description="MEMUNCERR  Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLUNCERR" description="FLUNCERR  Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MCANUNCERR" description="MCANUNCERR  Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WWDNMI" description="WWDNMI  Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECATNMI" description="ECATNMI  Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key protection" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMNMIFLGFRC" width="32" page="1" offset="0xc" internal="0" description="CMNMI Flag Force Register">
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL  Flag Force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MEMUNCERR" description="MEMUNCERR  Flag Force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLUNCERR" description="FLUNCERR  Flag Force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MCANUNCERR" description="MCANUNCERR  Flag Force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WWDNMI" description="WWDNMI  Flag Force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECATNMI" description="ECATNMI  Flag Force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key protection" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMNMIWDCNT" width="32" page="1" offset="0x10" internal="0" description="CMNMI Watchdog Counter Register">
		<bitfield id="NMIWDCNT" description="NMI Watchdog Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="CMNMIWDPRD" width="32" page="1" offset="0x14" internal="0" description="CMNMI Watchdog Period Register">
		<bitfield id="NMIWDPRD" description="NMI Watchdog Period" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="KEY" description="Key protection" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMNMISHDWFLG" width="32" page="1" offset="0x18" internal="0" description="CMNMI Shadow Flag Register">
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL  Shadow flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MEMUNCERR" description="MEMUNCERR  Shadow flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FLUNCERR" description="FLUNCERR  Shadow flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MCANUNCERR" description="MCANUNCERR  Shadow flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="WWDNMI" description="WWDNMI  Shadow flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ECATNMI" description="ECATNMI  Shadow flag" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
</module>
